## hello ors club

## DATA manipulation 
### using pandas

# Introduction:

pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the <font color="pink">Python</font> programming language.  <font color="pink">(based on numpy)</font> [link to documentation](https://pandas.pydata.org/docs/user_guide/index.html)

In [2]:
"""if you don't have the librarry installed then 
`pip install pandas` before you import           """
import pandas as pd

In [3]:
data = {'stats':['strength','speed','height','weight'],
        'classmate1':[95,90,90,1],
        'classmate2':[66,23,50,99],
        'classmate3':[85,60,99,44],
        'classmate4':[1,99,99,99]
}

#### loading your data frame:
the data may come from various sources usually from either excel files <font color="green">xslx </font> format or "Comma-separated values" files <font color="orange">csv </font>which happen to be our focus today but first let's just play arround with this dictionnary called <font color="orange">data</font>.

In [40]:
df = pd.DataFrame.from_dict(data)
#df is short for data frame, i'll be calling it so for the rest of the workshop
df

      stats  classmate1  classmate2  classmate3  classmate4
0  strength          95          66          85           1
1     speed          90          23          60          99
2    height          90          50          99          99
3    weight           1          99          44          99

In [15]:
# column selector 
df['stats']

0    strength
1       speed
2      height
3      weight
Name: stats, dtype: object

##### <font color="grey">DataFrame</font>Selection<font color="pink">*Property*</font>

you can also use the property displayed above to asign new columns

In [41]:
df['somebody']= [50,1,56,99]
df

      stats  classmate1  classmate2  classmate3  classmate4  somebody
0  strength          95          66          85           1        50
1     speed          90          23          60          99         1
2    height          90          50          99          99        56
3    weight           1          99          44          99        99

###### <font color="grey">DataFrame</font>.index <font color="pink">*Property*</font>
row labels "names" of each row

###### <font color="grey">DataFrame</font>.columns <font color="pink">*Property*</font>
column labels

In [5]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.columns

Index(['stats', 'classmate1', 'classmate2', 'classmate3', 'classmate4',
       'somebody'],
      dtype='object')

##### <font color="grey">DataFrame</font>.iloc[  ] <font color="pink">*Property*</font>


Purely integer-location based indexing for selection by position.
or in other words , select elements by column and line indexes.

iloc[line index,column index]

In [20]:
df.iloc[2]
#gives the third line counting from 0

stats         height
classmate1        90
classmate2        50
classmate3        99
classmate4        99
somebody          56
Name: 2, dtype: object

In [25]:
df.iloc[:,2]   
#gives the second column //counting from 0

0    66
1    23
2    50
3    99
Name: classmate2, dtype: int64

In [22]:
df.iloc[2,1]
#gives the specific element

90

##### <font color="grey">DataFrame</font>.loc[  ] <font color="pink">*Property*</font>


is primarily label based, but may also be used with a boolean array.
or in other words , uses the names of the collumns.

loc[line label,column label]

In [23]:
df.loc[:,"classmate3"]
#returns the column of the 3rd classmate (4th column)

0    85
1    60
2    99
3    44
Name: classmate3, dtype: int64

In [28]:
#to Note: the label for indexes is still a number unless you change it yourself
df.loc[1]
# this returns the second line (speed line)

stats         speed
classmate1       90
classmate2       23
classmate3       60
classmate4       99
somebody          1
Name: 1, dtype: object

In [29]:
#and lastly you can do the same as iloc and double index
df.loc[1,"classmate3"]

60

##### <font color="grey">DataFrame</font>.describe( ) 


Generate descriptive statistics.

Descriptive statistics include those that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.

Analyzes both numeric and object series, as well as DataFrame column sets of mixed data types. The output will vary depending on what is provided. Refer to the notes below for more detail.

.describe()

In [30]:
df.describe()
#this one is self explanatory

       classmate1  classmate2  classmate3  classmate4   somebody
count    4.000000    4.000000    4.000000         4.0   4.000000
mean    69.000000   59.500000   72.000000        74.5  51.500000
std     45.394566   31.754265   24.671171        49.0  40.120651
min      1.000000   23.000000   44.000000         1.0   1.000000
25%     67.750000   43.250000   56.000000        74.5  37.750000
50%     90.000000   58.000000   72.500000        99.0  53.000000
75%     91.250000   74.250000   88.500000        99.0  66.750000
max     95.000000   99.000000   99.000000        99.0  99.000000

##### <font color="grey">DataFrame</font>.T <font color="pink">*Property*</font>


gives the transposition of the Data frame.

.T

In [31]:
df.T

                   0      1       2       3
stats       strength  speed  height  weight
classmate1        95     90      90       1
classmate2        66     23      50      99
classmate3        85     60      99      44
classmate4         1     99      99      99
somebody          50      1      56      99

In [42]:
df = df.drop('classmate1',axis=1)
#give back the df without said column
df

      stats  classmate2  classmate3  classmate4  somebody
0  strength          66          85           1        50
1     speed          23          60          99         1
2    height          50          99          99        56
3    weight          99          44          99        99

In [43]:
df.drop(3)
#give back the df without said line

      stats  classmate2  classmate3  classmate4  somebody
0  strength          66          85           1        50
1     speed          23          60          99         1
2    height          50          99          99        56

In [44]:
# as you can see the df itself didn't change tho 
df
#so in order to change it you must sign the outcome of the functions above

      stats  classmate2  classmate3  classmate4  somebody
0  strength          66          85           1        50
1     speed          23          60          99         1
2    height          50          99          99        56
3    weight          99          44          99        99

In [45]:
df = df.drop(3)
# and yay now are df is no longer fat phobic (bad joke i know)

In [7]:
pip install pandas

Requirement already satisfied: pandas in c:\users\asus\appdata\local\programs\python\python310\lib\site-packages (1.3.4)Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 22.0.3; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Users\ASUS\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: pytz>=2017.3 in c:\users\asus\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\asus\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\asus\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.21.4)
Requirement already satisfied: six>=1.5 in c:\users\asus\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [17]:
df.to_csv("csvfile")

In [46]:
df

      stats  classmate2  classmate3  classmate4  somebody
0  strength          66          85           1        50
1     speed          23          60          99         1
2    height          50          99          99        56